[
  {
    category: "证书",
    child: [
      {
        name: "证书",
        image: "certificates.png",
        description: `
被传送来永恒大陆的冒险家们不同的考验

像往常那样去冒险吧，查理就在身边

当符合查理考验条件时，查理会来到冒险家身边使用魔法生成一张考验证书

每种考验证书对冒险者**仅一次机会**，请务必妥善保管好证书，不要遗失、擦除、烧掉了

每种考验证书仅在冒险家签上字后才算正式与查理建立契约
            `,
      },
      {
        name: "空证书",
        image: "certificate_blank.png",
        code: "certificate_blank",
        tech: "无",
        recipe: "莎草纸*1+羽毛笔*1",
        description: `
一张等待被书写的空证书
            `,
      },
      {
        name: "读者证书",
        image: "certificate_book.png",
        code: "certificate_book",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 首次对书籍感兴趣时（检查），查理会出现给予待完成的读者证书

**考验内容：**
- 读一次书降5耐久，并记录下读的书，再读已经记录的书仅降1耐久
- 图书管理员和老麦读书双倍降耐久

**装备效果：**
- 可以阅读所有书籍且能触发书籍的效果

**设定：**
- 书读百遍，其义自现。被查理认可的读者虽无法像图书管理员那样写书，但可以激发书中奥义
            `,
      },
      {
        name: "竞技证书",
        image: "certificate_combat.png",
        code: "certificate_combat",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 首次击杀怪物时，查理会出现给予待完成的竞技证书

**考验内容：**
- 仅击败头目（有epic标签的boss）时才会降耐久，当boss死亡时，以boss为中心范围内所有装备竞技证书的玩家都算击败者
- 当被击败头目的血量>=10k时，首次击败降10耐久，非首次击败降5耐久
- 当被击败头目的血量<10k时，首次击败降5耐久，非首次击败降2耐久

**装备效果：**
- 25%吸收伤害（女武神25%）
- 战斗时可缓慢的回复精神和血量
- 能制作女武神战斗矛和头盔
            `,
      },
      {
        name: "厨师证书",
        image: "certificate_cook.png",
        code: "certificate_cook",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 首次做饭时，查理会出现给予待完成的厨师证书

**考验内容：**
- 首次收获自己烹饪的料理时可降5耐久，再次收获相同料理仅降1耐久

**装备效果：**
- 可使用大厨的厨具（便携烹饪锅，便携香料站，便携研磨器）

**模组兼容：**
- 兼容自动做饭mod，找到自动做饭mod中的\`modmain.lua\`，打开大约在900-920行之间，找到\`ThePlayer:HasTag("masterchef")\`将其修改成\`ThePlayer:HasOneOfTags({"masterchef", "certificate_cook"})\`
            `,
      },
      {
        name: "钓鱼证书",
        image: "certificate_fish.png",
        code: "certificate_fish",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 首次钓上淡水鱼时，查理会出现给予待完成的钓鱼证书

**考验内容：**
- 青蛙池塘，蚊子池塘，绿洲，洞穴池塘，任选3种池塘每个池塘钓够10条鱼

**装备效果：**
- 大大缩短钓鱼时间
            `,
      },
      {
        name: "渔夫证书",
        image: "certificate_oceanfish.png",
        code: "certificate_oceanfish",
        tech: "无",
        recipe: "羽毛笔*1+钓鱼证书*1",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**考验内容：**
- 钓到16种海鱼（海鱼共18种，其中有2种是春节期间才会出现的）外加2种龙虾

**装备效果：**
- 钓上来**足够重**的海鱼
- 收获海草身上的藤壶而不会引起藤壶的仇恨
            `,
      },
      {
        name: "工程师证书",
        image: "certificate_engineer.png",
        code: "certificate_engineer",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 首次建造任意建筑时，查理会出现给予待完成的工程师证书

**考验内容：**
- 首次制作物品可降5耐久，再次制作已经记录的物品降1耐久

**装备效果：**
- 可制作可靠的胶布
- 可部署薇机人
- 可将放置好的眼球炮塔、恶液储存箱、辉煌铁匠铺、暗影术基座、冰眼结晶器收回
- 可使用针线包或可靠的胶布修补帐篷、遮阳篷、宿营帐篷，每次修补回复5使用次数
            `,
      },
      {
        name: "开荒证书",
        image: "certificate_till.png",
        code: "certificate_till",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 首次耕地时，查理会出现给予待完成的开荒证书

**考验内容：**
- 锄100次地后解锁

**装备效果：**
- 每次锄地有25%概率锄出蚯蚓
            `,
      },
      {
        name: "农业证书",
        image: "certificate_farm.png",
        code: "certificate_farm",
        tech: "无",
        recipe: "莎草纸*1+羽毛笔*1+开荒证书*1",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**考验内容：**
- 收获16种\`自己种的\`巨大作物（官方14种作物+模组内的2种）

**装备效果：**
- 每次锄地有25%概率锄出蚯蚓
- 像植物人那样随手种地

**模组兼容：**
- 兼容队列种植，将队列模组内的文件\`actionqueuer.lua\`打开，将大约600-700行间的\`ThePlayer:HasTag("plantkin")\`修改成\`ThePlayer:HasOneOfTags({"plantkin", "certificate_farm"})\`
            `,
      },
      {
        name: "采矿证书",
        image: "certificate_mine.png",
        code: "certificate_mine",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 首次开采石头时，查理会出现给予待完成的采矿证书

**考验内容：**
- 每次使用镐子降1耐久

**装备效果：**
- 镐子效率增加250%
            `,
      },
      {
        name: "伐木证书",
        image: "certificate_chop.png",
        code: "certificate_chop",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
首次砍倒树时，查理会出现给予待完成的伐木证书

**考验内容：**
每次使用斧子降1耐久

**装备效果：**
斧子效率增加250%
            `,
      },
      {
        name: "魔法证书",
        image: "certificate_magic.png",
        code: "certificate_magic_finish",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 舞台表演，有1/8概率获得

**装备效果：**
- 可制作魔法箱子和魔杖

**设定：**
- 可能是老麦表演太卖力不小心遗失的，证书中详细记录了魔法箱子如何制作
            `,
      },
      {
        name: "兔王任命书",
        image: "certificate_rabbit.png",
        code: "certificate_rabbit_finish",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 击杀机缘兔子召唤的兔子守卫有概率掉落

**装备效果：**
- 制作兔王手杖

**设定：**
- 守卫有任命书很正常吧！
            `,
      },
      {
        name: "猴王任命书",
        image: "certificate_monkey.png",
        code: "certificate_monkey_finish",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 击杀大副有概率掉落

**装备效果：**
- 划船比大头还快
- 可持证抢劫掏空食人花
- 不会被火药猴抢劫
            `,
      },
      {
        name: "鱼人王任命书",
        image: "certificate_merm.png",
        code: "certificate_merm_finish",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 击杀鱼人守卫1/8概率掉落

**装备效果：**
- 可制作沼泽地皮
- 可喂鱼人王，喂鱼人，让鱼人跟随成为小弟
- 可以像鱼妹一样提前看见触手的位置

**设定：**
- 只有鱼人王的守卫才有鱼人王任命书，普通鱼人只是平民
            `,
      },
      {
        name: "驯兽师证书",
        image: "certificate_tame.png",
        code: "certificate_tame",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 首次将牛铃与牛建立联系时，查理会出现给予待完成的驯兽师证书

**考验内容：**
- 将证书装备在身上，将\`自己的牛\`完全驯化

**装备效果：**
- 驯牛能加速20%（女武神技能加速15%）
- 养高鸟时，每天可抚摸一次高鸟可减少一天的成长时间
            `,
      },
      {
        name: "炼金证书",
        image: "certificate_alchemy.png",
        code: "certificate_alchemy_finish",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 开采被丢弃的垃圾1/8概率掉落

**装备效果：**
- 可像威尔逊一样炼金

**设定：**
- 垃圾堆里翻出什么东西都不奇怪
            `,
      },
      {
        name: "通灵证书",
        image: "certificate_ghost.png",
        code: "certificate_ghost",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 对小惊吓产生好奇心（检查）时，查理会出现给予通灵证书

**考验内容：**
- 给予小惊吓玩具，已经给过的玩具小惊吓是不会高兴的

**装备效果：**
- 能看到一些本不该看见的东西，比如羊、牛、脏物袋的刷新点
            `,
      },
      {
        name: "蜘蛛女王任命书",
        image: "certificate_spider.png",
        code: "certificate_spider",
        description: `
> 注：装备前要使用羽毛笔签上自己的名字

**获取：**
- 装备蜘蛛帽时，查理会出现给予通灵证书

**考验内容：**
- 向任命书献祭8种不同蜘蛛

**装备效果：**
- 可制作蜘蛛巢
- 可升级蜘蛛巢
- 可在蜘蛛巢里睡觉
- 蜘蛛对玩家保持中立
- 走在蜘蛛丝上不再减速
            `,
      },
    ]
  },
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  {
    category: "作物",
    child: [
      {
        name: "番薯植株",
        image: "cer_sweetpotato.png",
        code: "farm_plant_cer_sweetpotato",
        description: `
随机种子可长出番薯植株

- 稀有度：普通
- 季节：春夏秋作物
- 属性：水x1，生长素x-2，堆肥x4，粪肥x-2
- 产物：番薯
            `,
      },
      {
        name: "生姜植株",
        image: "cer_ginger.png",
        code: "farm_plant_cer_ginger",
        description: `
随机种子可长出生姜植株

- 稀有度：普通
- 季节：春夏作物
- 属性：水x2，生长素x-2，堆肥x1，粪肥x1
- 产物：生姜
            `,
      },
      {
        name: "番薯",
        image: "cer_sweetpotato.png",
        code: "cer_sweetpotato",
        foodtype: "VEGGIE",
        fresh: "10天",
        description: `
可生吃，可烤着吃，可榨油，可入锅当配菜

|饱|精|血|其它|
|---|---|---|---|
|25|1|3||
            `,
      },
      {
        name: "烤番薯",
        image: "cer_sweetpotato_cooked.png",
        code: "cer_sweetpotato_cooked",
        foodtype: "VEGGIE",
        fresh: "6天",
        description: `
|饱|精|血|其它|
|---|---|---|---|
|25|20|15||
            `,
      },
      {
        name: "番薯干",
        image: "cer_sweetpotato_dried.png",
        code: "cer_sweetpotato_dried",
        foodtype: "VEGGIE",
        fresh: "40天",
        description: `
2天晾干

|饱|精|血|其它|
|---|---|---|---|
|25|5|8||
            `,
      },
      {
        name: "生姜",
        image: "cer_ginger.png",
        code: "cer_ginger",
        foodtype: "VEGGIE",
        fresh: "20天",
        description: `
2天晾干

|饱|精|血|其它|
|---|---|---|---|
|9.375|-5|-3||
            `,
      },
    ]
  },
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  {
    category: "料理",
    child: [
      {
        name: "姜汤",
        image: "cer_gingersoup.png",
        code: "cer_gingersoup",
        foodtype: "好东西",
        fresh: "6天",
        description: `
生姜x2 + 洋葱x1 + 冰x1

|饱|精|血|其它|
|---|---|---|---|
|62.5|15|15|喝下后持续一天的保暖状态|
            `,
      },
      {
        name: "汉堡",
        image: "cer_hamburger.png",
        code: "cer_hamburger",
        foodtype: "好东西",
        fresh: "10天",
        description: `
肉度x1 + 蕨菜x1 + 菜度x1

|饱|精|血|其它|
|---|---|---|---|
|62.5|15|15||
            `,
      },
      {
        name: "番薯丸子",
        image: "cer_sweetpotatoballs.png",
        code: "cer_sweetpotatoballs",
        foodtype: "好东西",
        fresh: "10天",
        description: `
番薯x2 + 甜度x1

|饱|精|血|其它|
|---|---|---|---|
|37.5|50|20||
            `,
      },
      {
        name: "清蒸鱼",
        image: "cer_steamedfish.png",
        code: "cer_steamedfish",
        foodtype: "好东西",
        fresh: "8天",
        description: `
鱼度x1 + 生姜x1

|饱|精|血|其它|
|---|---|---|---|
|25|33|40||
            `,
      },
      {
        name: "姜糖",
        image: "cer_gingercandy.png",
        code: "cer_gingercandy",
        foodtype: "好东西",
        fresh: "40天",
        description: `
生姜x2 + 甜度x1

|饱|精|血|其它|
|---|---|---|---|
|25|15|8||
            `,
      },
    ]
  },
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  {
    category: "调味",
    child: [
      {
        name: "夜莓粉",
        image: "cer_spice_ancientfruit.png",
        code: "cer_spice_ancientfruit",
        description: `
3个夜莓研磨成2个夜莓粉，给料理调味，吃后可半天夜视
            `,
      },
      {
        name: "生姜粉",
        image: "cer_spice_ginger.png",
        code: "cer_spice_ginger",
        description: `
3个生姜研磨成2个生姜粉，给料理调味，吃后半天保暖
            `,
      },
    ]
  },
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  {
    category: "建筑",
    child: [
      {
        name: "石箱",
        image: "cer_stone_chest.png",
        code: "cer_stone_chest",
        tech: "一本",
        recipe: "石砖*3",
        description: `
与木箱大小一样，防火，无法使用弹性空间升级
            `,
      },
      {
        name: "大木箱",
        image: "cer_bigwoodchest.png",
        code: "cer_bigwoodchest",
        tech: "二本",
        recipe: "木板*5",
        description: `
与龙鳞宝箱大小一样，不防火，无法使用弹性空间升级
            `,
      },
      {
        name: "地窖",
        image: "cer_cellar.png",
        code: "cer_cellar",
        recipe: "石砖*4+木板*4+金铲子*1",
        description: `
有20个格子，仅能存放种植出来的作物，保鲜效果是盐盒的2倍

仅能在陆地上挖地窖
            `,
      },
    ]
  },
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  {
    category: "物品",
    child: [
      {
        name: "证书文件袋",
        image: "certificate_folder.png",
        code: "certificate_folder",
        recipe: "猪皮*2+绳子*2+蜂刺*1",
        description: `
14个格子，用来装证书和羽毛笔
            `,
      },
      {
        name: "兔王手杖",
        image: "cer_rabbitking_cane.png",
        code: "cer_rabbitking_cane",
        recipe: "兔王棍*1+行者手杖*1+恶魔燃料*2",
        description: `
手持移速加成50%，耐久30天，可使用海象牙修补
            `,
      },
      {
        name: "绝望石豌豆",
        image: "cer_dreadstonebean.png",
        code: "cer_dreadstonebean",
        recipe: "绝望石粑粑*1",
        description: `
装备农业证书在二本精练栏里制作

巨大蠕虫消化掉了坚硬的外壳，留下了有生命力的绝望石种子
            `,
      },
      {
        name: "绝望石剑",
        image: "cer_dreadstonesword.png",
        code: "cer_dreadstonesword",
        recipe: "绝望石*2+活木*1",
        description: `
基地伤害59.5与火腿棒一样，阵营伤害8.5，耐久不满时手持扣san回耐久

因为不会长时间手持，所以扣的san和回复的耐久是绝望石甲/头的双倍
            `,
      },
      {
        name: "魔杖",
        image: "cer_wand.png",
        code: "cer_wand",
        tech: "魔法二本",
        recipe: "紫宝石*2+恶魔燃料*4+活木*1",
        description: `
装备魔法证书在魔法二本处制作

- 使用时装备炼金证书，可对石头施法“点石成金”将石头转成金块
- 使用时装备魔法证书，可对洞穴蠕虫施法，将其转变成巨大蠕虫，此操作不受世界设置影响
            `,
      },
      {
        name: "绝望石粑粑",
        image: "cer_dreadstone_poop.png",
        code: "cer_dreadstone_poop",
        description: `
当地下的巨大蠕虫吃到绝望石时，会消化成绝望石粑粑

肥力：生长素x8，堆肥x0，粪肥x0
            `,
      },
      {
        name: "蚯蚓",
        image: "cer_earthworm.png",
        code: "cer_earthworm",
        description: `
穿戴认证的开荒证书或认证的农业证书锄地有25%概率锄出蚯蚓

蚯蚓在地上一段时间会钻入地下消失，掉在海上会沉下去

蚯蚓可用作鱼饵，不分季节，不分早晚，功能最全的鱼饵

|饱|精|血|其它|
|---|---|---|---|
|4.7|-10|1||
            `,
      },
      {
        name: "金砖",
        image: "cer_cutgold.png",
        code: "cer_cutgold",
        tech: "二本",
        recipe: "金块*3",
        description: `
由金块锻造而成
        `,
      },
      {
        name: "黄金手炉",
        image: "cer_handwarmer.png",
        code: "cer_handwarmer",
        tech: "二本",
        recipe: "金砖*2+暖石*1",
        description: `
一个精巧的手炉，非能工巧匠不能做，女工或装备工程师证书可制作

**效果：**
- 带有一个格子，可放木炭或冰块
- 一块木炭可提供3分钟的供暖
- 一块冰可提供3分钟的低温
- 当供暖时，会发出微弱的光，只要手炉内有燃料就会一直烧下去，除非手动将其拿出
        `,
      },
      {
        name: "黄金锤子",
        image: "cer_goldhammer.png",
        code: "cer_goldhammer",
        tech: "二本",
        recipe: "木材*1+金块*6+绳子*2",
        description: `
斧，镐，铲，草叉都有金质的，锤子怎么能少！
        `,
      },
      {
        name: "怪物火腿棒",
        image: "cer_monsterhambat.png",
        code: "cer_monsterhambat",
        tech: "二本",
        recipe: "怪物肉*2+绳子*2",
        description: `
与火腿棒一样，拿手上掉san
        `,
      },
    ]
  },
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  {
    category: "植物",
    child: [
      {
        name: "绝望石灌木",
        image: "cer_dreadstoneshrub.png",
        code: "cer_dreadstoneshrub",
        description: `
绝望石豌豆 种下 -> 绝望石芽

绝望石芽 长大 -> 绝望石灌木

绝望石灌木开采后可得2个绝望石
            `,
      },
    ]
  },
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  {
    category: "芯片",
    child: [
      {
        name: "战斗电路",
        image: "wx78module_cer_combat.png",
        code: "wx78module_cer_combat",
        recipe: "生物数据*6+启迪碎片*1",
        description: `
**解锁：**
- 扫描第三阶段的天体英雄

**效果：**
- 3个针脚，点亮后增加25%伤害
            `,
      },
      {
        name: "防御电路",
        image: "wx78module_cer_defense.png",
        code: "wx78module_cer_defense",
        recipe: "生物数据*4+大理石*2",
        description: `
**解锁：**
- 扫描石虾

**效果：**
- 3个针脚，点亮后25%吸收伤害
            `,
      },
      {
        name: "放电电路",
        image: "wx78module_cer_lightning.png",
        code: "wx78module_cer_lightning",
        recipe: "生物数据*6+电羊角*2",
        description: `
**解锁：**
扫描电羊

**效果：**
- 3个针脚，点亮后攻击有带电伤害
            `,
      },
    ]
  },
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  {
    category: "地板",
    child: [
      {
        name: "真黄金地板",
        image: "turf_cer_gold.png",
        tech: "二本",
        recipe: "金砖*1",
        description: `
金光大道，前途一片光明

走在上面加速与石砖路一样
            `,
      },
    ]
  },
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  //----------------------------------------------------------------------------
  {
    category: "变动",
    child: [
      {
        name: "WX78扫描",
        image: "Bio_Scanalyzer.png",
        description: `
电气化电路扫描对象更换为亮茄
            `,
      },
      {
        name: "食人花",
        image: "Fleshy_Bulb.png",
        description: `
移除了食人花、巨大作物、贝壳堆、沉底宝箱的碰撞体积
            `,
      },
      {
        name: "浇水壶",
        image: "Watering_Can.png",
        description: `
浇水壶放在地上，下雨时会缓慢的收集雨水，收集速度与雨量有关
            `,
      },
      {
        name: "多枝树",
        image: "Twiggy_Tree_Tall.png",
        description: `
三阶段的多枝树可采集2根树枝，采集完多枝树回到二阶段继续生长
            `,
      },
    ]
  },
];
