[
    {
        title: "1.0.8更新内容",
        version: "1.0.8",
        date: "2026-03-01",
        description: `
### 新增内容：
**渔夫证书装备效果：**
- 钓海鱼有50%概率不消耗一次性鱼饵
- 中断钓鱼时如果已经上钩仅扣除**鱼饵耐久**，鱼饵和浮漂不再直接消失

**猴王任命书装备效果：**
- 击杀火药猴不会掉诅咒

**驯兽师证书装备效果：**
- 性情的牛不再主动攻击玩家

**蜘蛛女王任命书装备效果：**
- 蜘蛛和蜘蛛女王对玩家保持中立

**齿轮粉**
- 1个齿轮研磨成2个齿轮粉，给料理调味，吃后半天加速11/7

**镰刀**
- 快速收割物资，范围是2，暗影镰刀收割范围是4

**黄金镰刀**
- 快速收割物资，范围是3，暗影镰刀收割范围是4

**碰撞体积**
- 去掉 疙瘩树种子、恶液储存箱 的碰撞体积

**留声机**
- 打开留声机除非手动关闭，否则会一直演奏下去

**阻挡**
- 鸟，胡蝶，种子不再阻挡种植

**鱼饵**
- 非一次性鱼饵增加使用次数，可钓10条鱼。鱼上钩且钓上来或咬钩后未钓上来均扣除一次

### 已有内容变更：
**战斗电路**
- 由扫描天体英雄更改为扫描高鸟
- 制作配方 生物数据\\*4+高鸟蛋\\*1

### BUG修复：
- 游戏客户端莫名未响应问题修复
`
    },
    {
        title: "介绍文档完工",
        version: "1.0.0",
        date: "2026-01-22",
        description: `
初始化
`
    }
]
