[{
    title: "问题修复&调整&小更新",
    version: "1.0.0.11",
    date: "2022-11-19",
    description: `
1. 修复了在魔力花附近离开世界（如换人）可能导致崩溃的问题（也许）
2. 修复了炼钢炉产出带皮肤的灰烬的问题（雾）
3. 修复了冶炼完成的炼钢炉重载游戏时产物仅为1的问题
4. 修复了本模组的地皮不能放进刮地皮头盔的问题
5. 空心树桩的拓印回归，但只能放置在落叶林地皮上。附注：杜绝猫窝再生的一个有效方法是，摧毁猫窝后将原地皮覆盖为人工地皮。原理见穆白white的视频BV1Z94y1S73z
6. 修改了高脚鸟巢配方（需要小高脚鸟，可被陷阱捕捉了），高脚鸟巢的放置要求与无家可归的高脚鸟筑巢要求相同；掏鸟蛋出的高脚鸟不会筑巢（但也不会消失）
7. 三色蘑菇孢子种子种在有养分的蘑菇农场上可变为相应的蘑菇树
8. 秋天在皮弗娄牛草原翻脚印可能翻出皮弗娄牛
9. 悬赏令现在可以在制图桌处擦除为蜡纸
`
}, {
    title: "问题修复",
    version: "1.0.0.10",
    date: "2022-09-02",
    description: `
1. 修复了炼钢炉冶炼错误配方时导致崩溃的问题
2. 修复了导致一些模组物品无法添加燃料的问题
`
}, {
    title: "问题修复&调整&兼容",
    version: "1.0.0.9",
    date: "2022-09-01",
    description: `
1. 修复了猎犬丘在受击或被作祟时崩溃的问题
2. 修复了特定情景下椰子被敲开导致崩溃的问题
3. 修复了与《岛屿冒险》一起开启时咖啡丛和蛇毒的一些问题
4. 调整了wx-78抹黄油时的台词
5. 椰子树在应用造林学的催熟下会自动停止在最大生长阶段了
6. 携带天界令牌时有影怪来袭的限制改为:启迪状态下不会有影怪来袭
7. 拔苗助长只有空手时可执行了（方便行为学浇水、对话等操作）
8. 炼钢炉的重铸可以继承皮肤了（收获者有该皮肤才可以继承，另外炼钢炉上显示的成品仍然是没有皮肤的样子，暂且不管）
9. 炼钢炉可以批量冶炼了，冶炼总时间受产物种类及数量影响，放进去的多余物资会掉落
`
}, {
    title: "问题修复&调整&兼容",
    version: "1.0.0.8",
    date: "2022-08-08",
    description: `
1. 修复播放被薅了的鲨鱼、浣猫、蠕虫的动画时导致的加载范围内玩家闪退的问题
2. 修复了在薇诺娜的发电机上触电死亡导致的崩溃
3. 沃姆伍德种椰子也能回复理智了
4. 洗劫海象营地的的产物加入了海象牙，其概率与 海象营地数量及海象再生速度 呈负相关
5. 在制作栏的雨具分类中也可以找到蛇皮夹克和蛇皮帽了；在科技分类中也可以找到炼钢炉了
6. 蛇皮夹克优先装备：护甲栏>身体栏
7. 大幅调整了料理增加的痛风值，调整尽可能考量了料理属性、获取难度、烹饪价值等；触发痛风的临界值调整为100，食用酸奶可降低10点痛风值，每天痛风值自然降低7点。
8. 贪婪火腿棒可以放入棱镜的青枝绿叶中了（感谢 棱镜作者梧生 及 海洋传说作者鱼仔 的帮助）
`
}, {
    title: "问题修复&调整",
    version: "1.0.0.7",
    date: "2022-07-26",
    description: `
1. 临摹大理石雕像基座出来的暗影BOSS受到过量伤害打击时，无法将暗影力量传递出去
2. 堕落虫洞可以被主动移除了，同样会返还坎普斯背包。晚上将化石碎片给予堕落虫洞，有1/16几率变成暗影编织者（不同区域形态不同）；魔力泉水也可以净化堕落虫洞的生命
3. 生命水球可以对棕榈松果树生效了
4. 魔力花被铲掉会掉落魔力泉水了；魔力花被作祟时，一个屏幕内的魔力花都会共鸣；魔力花刚被种下时无法作祟
5. “生物怪圈”的生成角度有了随机性
6. 修复上次地皮修改遗留的小问题
`
}, {
    title: "问题修复&调整",
    version: "1.0.0.6",
    date: "2022-07-05",
    description: `
1. 适配五格装备栏：旋涡斗篷优先装备在背部，彩虹护符优先装备在颈部
2. 修复了堕落虫洞连接到其本身的问题
3. 暗影三基佬可以无视旋涡斗篷的免伤了
`
}, {
    title: "问题修复",
    version: "1.0.0.5",
    date: "2022-07-03",
    description: `
1. 修复了椰子树各生长阶段贴图不显示的问题（借鉴了三合一）
2. 对坎普斯背包的黑心实验可以在船上进行了
3. 堕落虫洞被移除时（一般为船或码头的崩坏，代码也可实现）会返还坎普斯背包，同时原本连接的虫洞会断开连接
`
}, {
    title: "完善合金工具",
    version: "4.1.8",
    date: "2022-06-12",
    description: `
1. 完善合金工具（斧，镐，铲，锤）工作时的动画贴图
2. 添加合金园艺锄，一次可挖9个坑
`
}, {
    title: "常规更新",
    version: "4.1.7",
    date: "2022-06-10",
    description: `
1. 修复效率镐子挖冰球的问题
2. 修复地皮优先级
3. 曼德拉长老不攻击植物人
4. 蛇酒调整到33%防御
5. 修复天亮的时候蛇会出来
`
}, {
    title: "蛇皮",
    version: "4.1.6",
    date: "2022-06-05",
    description: `
1. 修复吃一个料理有两种buff时，界面上只显示一个buff的图标
2. 修复冬天做水球立即就结冰
3. 蛇添加蛇皮掉落
4. 添加蛇皮帽，70%防水防雷，戴上后蛇将视为友好且青蛙不敢主动攻击
5. 添加蛇皮夹克，保暖60，70%防水防雷，穿上后蛇将视为友好且青蛙不敢主动攻击
6. 添加蛇皮地毯
7. 蛇酒防御改为25%且防雷
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-06-03",
    description: `
1. 修复鬼魂在女工发电机旁也会有触电台词的问题
2. 官方给蘑菇灯添加了个设定，给蘑菇灯里添加一个启迪之冠碎片，蘑菇灯里的孢子或者光果就能永久保鲜，所以富贵里用能量核升级蘑菇灯的功能就去掉了。
3. 与启迪之冠碎片一样，能量核也能放进蘑菇灯里充当永亮光源，且蘑菇灯里光果或者孢子也不会腐烂
4. 解决岩浆变成黑曜石会多于3个的问题（应该解决了！）
5. 增加戴彩虹护符收获很快就能完成
6. 修复天体二阶段拆能量核后旋转不会跟随玩家的问题
7. 满月/新月临摹修好的雕像不会碎掉了
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-05-31",
    description: `
1. 修复收获杂草没有种子的问题
2. 彩虹宝石去掉绿宝石和橙宝石能力，增加快采功能，燃料添加每次17%-18%，稍微降低了制作成本
3. 添加帝王蟹掉落蟹钳
4. 蟹钳可用来做油井钻子
5. 油井钻子在深海可部署开始钻油井
6. 添加焦油提取器
7. 添加柏油路，焦油+3石头=4柏油路地皮，行走在上面加速50%
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-05-25",
    description: `
### 调整

1. 修复椰子树不掉椰子的问题
2. 修复黑心无法对小偷包实验的问题
3. 修复部分配方出现在其它分类里的问题
4. 圆石可堆叠了，且开采掉落各色宝石概率均有提升

### 新增

1. 大豆作物：夏，秋作物，消耗水x1，恢复催长素x4，消耗堆肥x2，粪肥x2
2. 豆腐料理：2大豆+冰+灰烬。腐烂后变成臭豆腐
3. 豆粉：3大豆在研磨站研磨成2份豆粉
4. 豆浆：豆粉+冰+冰+蜂蜜
5. 豆奶：豆粉+冰+奶+蜂蜜
6. 冰球：当水球温度降到0度时会凝固成冰球，冰球用镐子开采可获得2-3块冰
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-05-18",
    description: `
### 调整

1. 椰子树根长时间不挖也会消失了
2. 猫窝官方做了防灭绝，所以富贵里就关掉拓印功能了
3. 修复悬赏令未交付完无法再次交付的问题
4. 岩浆冷却后转成黑曜石的个数，从之前1-2块提升到目前的2-3块（黑曜石工具貌似都无人问津）

### 新增

1. 洒水器，放置时要离水边5格地皮内，有效范围以洒水器为中心2格半地皮
2. 拔苗助长，作物生长期间可进行一次拔苗助长，直接跳过一个生长阶段，但作物会非常不开心
3. 给果蝇喂一个蜂王浆将大大提升果蝇的幸福感，照料作物都更效率了
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-05-09",
    description: `
1. 修复杂草种子不能放进种子袋的问题
2. 修复贪婪火腿换贴图后没法用毒腺抹毒的问题
3. 龙心与龙心灌蛋buff改为互克，且龙心灌蛋有效时间从一天改为半天
4. 再次优化buff计时
5. 稍微提升一下岩浆的发光范围以及温度的阶段对发光的影响
6. 悬赏令不能放进打包袋了
7. 咖啡树换成使用灰烬施肥，且夏天不会枯萎
8. 增加蛋白粉，4鸡腿在锅中制作，大力士吃了能锁住肌肉半天
9. 修墓增加墓志铭
10. 添加远古锅可拓印，修改远古锅属性：烹饪速度与大厨锅一样
11. 增加一个”胖“查理守卫
`
}, {
    title: "常规更新",
    version: "4.0.4",
    date: "2022-05-03",
    description: `
1. 限制堕落虫洞不能在海上（船）生成
2. 青年座狼可被抹毒武器攻击中毒
3. 魔力泉水地图上显示
4. 蟾蜍宝箱增加功能，腐烂速度是冰箱的20倍，且不能使用能量核升级
5. 添加根箱，当前世界里所有根箱共用一个容器。只能植物人制作
6. 发电机漏电能给机器人充能
`
}, {
    title: "常规更新",
    version: "4.0.3",
    date: "2022-04-30",
    description: `
1. 修改任务描述：薇诺娜找她的妹妹还没有回来，我需要点针线包来修补衣服
2. 暗影火腿棒变更为新物品“贪婪火腿棒”，并具有新贴图。除原来暗影火腿棒的效果外，当攻击目标时，会吸食目标血液来恢复自身新鲜度
3. 使用黑心对坎普斯背包实验，实验成功后会将转换成堕落虫洞
4. 大幅度提升悬赏令奖励圆石数量
5. 能量核升级背包增加种子袋
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-04-24",
    description: `
1. 修复发电机烧毁时站在旁边崩溃的问题
2. 彩虹护符分解不返还宝石
3. 被能量核升级过的背包或者容器，砸掉或者分解均会返还能量核
4. 蟾蜍宝箱兼容showme的高亮显示（代码来自勋章）
5. “薅”的对象带着罪恶值，有的加，有的减，有的没有
6. 优化守卫的出现，不至于太突兀
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-04-18",
    description: `
1. 添加蟾蜍宝箱
2. 添加悬赏任务，奖励彩虹护符制作蓝图
3. 食谱中可显示料理的副作用了（包括原版料理中吃了会痛风的料理）
4. 修复合金工具在水上不显示贴图的问题
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-04-15",
    description: `
1. 修复火把打椰树精导致游戏崩溃的问题
2. 修复养鱼场投放鱼子后鼠标放上去不显示是什么鱼的问题
3. 修复生命水球特效不消失的问题
4. 修复岩浆扔水里会多给黑曜石的问题（注意不要扔船上）
5. 再次更新椰子树刷新机制（为了解决中途添加或者去掉本模组对存档的影响）
6. 增加路灯的光照范围，之前5，目前7，如果基地是九宫格的话，四周各放一个路灯，正好能把家全照亮
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-04-14",
    description: `
1. 养鱼场增大放置间隔
2. 修复养鱼场蓝图名称的显示问题
3. 调整养鱼场产鱼速度
4. 蟹奶奶商店新增两张蓝图：蜂箱，晾肉架
`
}, {
    title: "养鱼场",
    version: "",
    date: "2022-04-13",
    description: `
【调整】
1. 修改永恒冰箱的保鲜机制，不再影响暖石的降温了
2. 取消路灯的放置间隔
3. 召唤出来的科学家2分钟后任务还没交付，会消失
4. 添加料理，鱼子酱。3鱼子+1蔬菜

【养鱼场】
1. 鱼场蓝图可在蟹奶奶商店（到达5级）换取
2. 鱼场刚造好是没有鱼的，需要给予对应海鱼的鱼籽
3. 鱼籽可通过杀海鱼获得
4. 将鱼籽投放给养鱼场后鱼场才会刷新鱼
5. 鱼场共4个阶段，1：空，2：鱼籽，3：一条鱼，4：两条鱼
6. 鱼场在3，4阶段可收网获得里面的鱼
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-04-10",
    description: `
1. 添加椰子精
2. 修复悬赏令可用行为学重复交易
3. 提升修墓优先级，解决与神话的动作覆盖冲突
4. 更换椰子树的再生方式
5. 摘椰子1/40概率出椰子精
6. 修复曼德拉长老死亡时动画不对的问题
`
}, {
    title: "悬赏任务系统",
    version: "",
    date: "2022-04-08",
    description: `
【调整】
1. 修复者行杖攻击掉耐久
2. 调整瑶柱属性0.5肉，0.5鱼
3. 更换魔化法杖，杂草种子贴图

【悬赏任务系统】
1. 触发：玩家在永恒大陆上每次“薅”的动作都会积累罪恶值，罪恶值到达阈值时查理会派卫士来收拾玩家
2. 悬赏令获取：击败卫士可以获得查理与科学家“PY交易”的悬赏令
3. 任务内容：鼠标放在悬赏令上可以查看任务详情
4. 交付任务：对悬赏令右键”交付“，会召唤出科学家，将准备好的材料递给科学家即可。注意：请务必一次性交付，给科学家的材料是不会返还的
5. 奖励：圆石若干。
6. 圆石用处：可用镐子开采，开采出来随机获得各色宝石和大理石。
`
}, {
    title: "介绍文档完工",
    version: "",
    date: "2022-04-06",
    description: `
富贵的文档之前一直是 **某幻想家** 在掌上饥荒维护更新的，今天富贵有自己的介绍网站了

网站风格模仿勋章的模组介绍页面写的。

鸣谢：**某幻想家**提供的素材，**hello青蛙**帮忙一块整理内容
`
}]
