[
    {
        category: "设定",
        child: [{
            name: "年龄",
            description: `
**旺达的年龄本质是血量，与度日如年里的年龄无关**

寿命到头即寿终正寝

#### 人物年龄

除了机器人，恶魔人，植物人，旺达外，其他人物都有年龄属性

| 人物 | 初始年龄 | 最大年龄 |
|---|---|---|
|威尔逊|20|100|
|火女|20|100|
|大力士|20|100|
|温蒂|10|100|
|图书管理员|50|100|
|伍迪|20|100|
|韦斯|20|100|
|老麦|20|100|
|女武神|20|100|
|蜘蛛人|10|100|
|女工|20|100|
|厨子|20|100|
|鱼妹|10|100|
|小男孩|10|100|

所有模组人物均为 20-100 岁

#### 生物年龄

绝大部分生物也都有年龄

| 生物 | 最大年龄 |
|---|---|
|猪人|20|
|兔人|20|
|鱼人|20|
|蜘蛛|5|
|兔子|10|
|青蛙|10|
|猫|15|
|鼹鼠|5|
|蝙蝠|10|
|高鸟|20|
|牛|50|
|象|70|
|羊|20|
|草蜥蜴|10|
|猴子|20|
|石虾|100|
|蜗牛|10|
|无眼鹿|30|
|狗|15|

            `,
        }, {
            name: "Boss升级",
            description: `
在度日如年里，Boss会越战越勇（Boss是指代码层面有 \`epic\` 标签的生物）

默认boss等级是0，鼠标放在boss身上可看当前boss的等级
每击杀一次，boss就会升一级，无上限

等级对应着boss的血量，伤害，移速，攻速，体型等的变化

| |0级|1级|2级|...|+∞|
|---|---|---|---|---|---|
|血量|-|+10%|+20%|...|+∞|
|伤害|-|+10|+20|...|750|
|移速|-|+10%|+20%|...|10|
|攻速|-|-5%|-10%|...|1.5|
|体型|-|+10%|+20%|...|150%|
|核心|-|+5%|+10%|...|50%|
            `,
        }, {
            name: "读书",
            description: `
图书管理员每读一次书都会消耗一年（游戏一天）的寿命
            `,
        }, {
            name: "回血",
            description: `
所有人物均不能再从食物中直接回血了，但所有人物都有自愈能力，身体的自愈受心情（san）影响，心情越好，自愈越快

|san值百分比|自愈速度(hp/10s)|
|---|---|
|>=80%|1|
|>=50%|0.75|
|>=30%|0.5|
|<30%|0.25|
            `,
        }, {
            name: "配方",
            description: `
部分原版物品的配方有调整

机器人的所有芯片均需要一个电子原件
冰箱，盐箱配方中增加一个电子原件
电子原件：铜块x2+石砖
矿工帽：电子元件x2+草帽+金块x2
            `,
        }]
    },
    {
        category: "技能",
        child: [{
            name: "务农",
            description: `
收获140个巨大作物后则精通务农，此后照料作物可使作物额外减压
            `
        }]
    },
    {
        category: "建筑",
        child: [{
            name: "发酵桶",
            code: "odoy_brewingbarrel",
            recipe: "铜块x2+木板x4",
            tech: "二本",
            description: `
可将水果，蔬菜，肉，蛋等发酵
            `
        }]
    },
    {
        category: "物品",
        child: [{
            name: "铜块",
            code: "odoy_copper",
            image: "odoy_copper.png",
            description: `
新矿，替代部分金块的功能
可在铜矿地形挖铜矿掉落，或者打发条生物掉落
            `
        }]
    },
    {
        category: "地形",
        child: [{
            name: "铜矿",
            description: `
地面与洞穴均增加一个新地形 - 铜矿地形

地面上的铜矿地形必刷一个虫洞，有小概率会刷高鸟
铜矿是可再生的，每隔10天会尝试刷新铜矿
            `,
        }]
    },
    {
        category: "发酵系统",
        child: [{
            name: "果酒",
            image: "odoy_fruitwine.png",
            code: "odoy_fruitwine",
            foodtype: "GOODIES",
            fresh: "无",
            description: `
果度>=4 在发酵桶中发酵5年(游戏5天)即可收获一瓶果酒

|饱|精|血|其它|
|---|---|---|---|
|25|50|0||
            `
        }, {
            name: "腌菜",
            image: "odoy_pickle.png",
            code: "odoy_pickle",
            foodtype: "蔬菜",
            fresh: "70天",
            description: `
菜度>=4 在发酵桶中发酵3年(游戏3天)即可收获一瓶腌菜

|饱|精|血|其它|
|---|---|---|---|
|75|5|0||
            `
        }]
    },
    {
        category: "Boss核心",
        child: [{
            name: "热核",
            image: "odoy_dragonflycore.png",
            code: "odoy_dragonflycore",
            description: `
击杀龙蝇有概率掉落热核，热核放在地上会对四周释放热量，可在热核上烤食物吃

热核也是青铜鼎的制作材料之一

掉落概率见boss升级
            `
        }]
    },
];
