let version = [{
    title: "常规更新",
    version: "4.0.3",
    date: "2022-04-30",
    description: `
1. 修改任务描述：薇诺娜找她的妹妹还没有回来，我需要点针线包来修补衣服
2. 暗影火腿棒变更为新物品“贪婪火腿棒”，并具有新贴图。除原来暗影火腿棒的效果外，当攻击目标时，会吸食目标血液来恢复自身新鲜度
3. 使用黑心对坎普斯背包实验，实验成功后会将转换成堕落虫洞
4. 大幅度提升悬赏令奖励圆石数量
5. 能量核升级背包增加种子袋
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-04-24",
    description: `
1. 修复发电机烧毁时站在旁边崩溃的问题
2. 彩虹护符分解不返还宝石
3. 被能量核升级过的背包或者容器，砸掉或者分解均会返还能量核
4. 蟾蜍宝箱兼容showme的高亮显示（代码来自勋章）
5. “薅”的对象带着罪恶值，有的加，有的减，有的没有
6. 优化守卫的出现，不至于太突兀
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-04-18",
    description: `
1. 添加蟾蜍宝箱
2. 添加悬赏任务，奖励彩虹护符制作蓝图
3. 食谱中可显示料理的副作用了（包括原版料理中吃了会痛风的料理）
4. 修复合金工具在水上不显示贴图的问题
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-04-15",
    description: `
1. 修复火把打椰树精导致游戏崩溃的问题
2. 修复养鱼场投放鱼子后鼠标放上去不显示是什么鱼的问题
3. 修复生命水球特效不消失的问题
4. 修复岩浆扔水里会多给黑曜石的问题（注意不要扔船上）
5. 再次更新椰子树刷新机制（为了解决中途添加或者去掉本模组对存档的影响）
6. 增加路灯的光照范围，之前5，目前7，如果基地是九宫格的话，四周各放一个路灯，正好能把家全照亮
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-04-14",
    description: `
1. 养鱼场增大放置间隔
2. 修复养鱼场蓝图名称的显示问题
3. 调整养鱼场产鱼速度
4. 蟹奶奶商店新增两张蓝图：蜂箱，晾肉架
`
}, {
    title: "养鱼场",
    version: "",
    date: "2022-04-13",
    description: `
【调整】
1. 修改永恒冰箱的保鲜机制，不再影响暖石的降温了
2. 取消路灯的放置间隔
3. 召唤出来的科学家2分钟后任务还没交付，会消失
4. 添加料理，鱼子酱。3鱼子+1蔬菜

【养鱼场】
1. 鱼场蓝图可在蟹奶奶商店（到达5级）换取
2. 鱼场刚造好是没有鱼的，需要给予对应海鱼的鱼籽
3. 鱼籽可通过杀海鱼获得
4. 将鱼籽投放给养鱼场后鱼场才会刷新鱼
5. 鱼场共4个阶段，1：空，2：鱼籽，3：一条鱼，4：两条鱼
6. 鱼场在3，4阶段可收网获得里面的鱼
`
}, {
    title: "常规更新",
    version: "",
    date: "2022-04-10",
    description: `
1. 添加椰子精
2. 修复悬赏令可用行为学重复交易
3. 提升修墓优先级，解决与神话的动作覆盖冲突
4. 更换椰子树的再生方式
5. 摘椰子1/40概率出椰子精
6. 修复曼德拉长老死亡时动画不对的问题
`
}, {
    title: "悬赏任务系统",
    version: "",
    date: "2022-04-08",
    description: `
【调整】
1. 修复者行杖攻击掉耐久
2. 调整瑶柱属性0.5肉，0.5鱼
3. 更换魔化法杖，杂草种子贴图

【悬赏任务系统】
1. 触发：玩家在永恒大陆上每次“薅”的动作都会积累罪恶值，罪恶值到达阈值时查理会派卫士来收拾玩家
2. 悬赏令获取：击败卫士可以获得查理与科学家“PY交易”的悬赏令
3. 任务内容：鼠标放在悬赏令上可以查看任务详情
4. 交付任务：对悬赏令右键”交付“，会召唤出科学家，将准备好的材料递给科学家即可。注意：请务必一次性交付，给科学家的材料是不会返还的
5. 奖励：圆石若干。
6. 圆石用处：可用镐子开采，开采出来随机获得各色宝石和大理石。
`
}, {
    title: "介绍文档完工",
    version: "",
    date: "2022-04-06",
    description: `
富贵的文档之前一直是 **某幻想家** 在掌上饥荒维护更新的，今天富贵有自己的介绍网站了

网站风格模仿勋章的模组介绍页面写的。

鸣谢：**某幻想家**提供的素材，**hello青蛙**帮忙一块整理内容
`
}];

export default version;
